
## Plan Result (prod)




<pre><code>Plan: 2 to add, 15 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_eventgrid_event_subscription.mig-event-supscription
  * azurerm_logic_app_workflow.migration_scan
* Update
  * azurerm_eventgrid_topic.mig-scanner[0]
  * azurerm_key_vault_secret.app_insights_connection_string
  * azurerm_linux_virtual_machine.migration[0]
  * azurerm_linux_virtual_machine.migration-linux[&#34;prddartsmigdb01&#34;]
  * azurerm_linux_virtual_machine.migration-linux2[&#34;prddartsmigdb02&#34;]
  * azurerm_linux_virtual_machine.oracle[&#34;prddartsmigora01&#34;]
  * azurerm_log_analytics_workspace.migration-analytics[0]
  * azurerm_recovery_services_vault.darts-migration-backup[0]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsassess&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsassure&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig01&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig02&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig03&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig04&#34;]
  * azurerm_windows_virtual_machine.migration_windows[&#34;prddartsmig05&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_eventgrid_event_subscription.mig-event-supscription will be created
  + resource "azurerm_eventgrid_event_subscription" "mig-event-supscription" {
      + advanced_filtering_on_arrays_enabled = false
      + event_delivery_schema                = "EventGridSchema"
      + eventhub_endpoint_id                 = (known after apply)
      + hybrid_connection_endpoint_id        = (known after apply)
      + id                                   = (known after apply)
      + included_event_types                 = (known after apply)
      + name                                 = "darts-event-prod-subscription"
      + scope                                = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg"
    }

  # azurerm_eventgrid_topic.mig-scanner[0] will be updated in-place
  ~ resource "azurerm_eventgrid_topic" "mig-scanner" {
        id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.EventGrid/topics/darts-event-prod"
        name                          = "darts-event-prod"
      ~ tags                          = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (9 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "app_insights_connection_string" {
        id                      = "https://darts-prod.vault.azure.net/secrets/app-insights-connection-string/1110af4c70bc42a1a55d8baffed07a9a"
        name                    = "app-insights-connection-string"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_linux_virtual_machine.migration[0] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "migration" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/migration-vm"
        name                                                   = "migration-vm"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.migration-linux["prddartsmigdb01"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "migration-linux" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdb01"
        name                                                   = "prddartsmigdb01"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.migration-linux2["prddartsmigdb02"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "migration-linux2" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigdb02"
        name                                                   = "prddartsmigdb02"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_linux_virtual_machine.oracle["prddartsmigora01"] will be updated in-place
  ~ resource "azurerm_linux_virtual_machine" "oracle" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmigora01"
        name                                                   = "prddartsmigora01"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # azurerm_log_analytics_workspace.migration-analytics[0] will be updated in-place
  ~ resource "azurerm_log_analytics_workspace" "migration-analytics" {
        id                                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.OperationalInsights/workspaces/darts-migration-analytics-workspace"
        name                                    = "darts-migration-analytics-workspace"
      ~ tags                                    = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (14 unchanged attributes hidden)
    }

  # azurerm_logic_app_workflow.migration_scan will be created
  + resource "azurerm_logic_app_workflow" "migration_scan" {
      + access_endpoint                 = (known after apply)
      + connector_endpoint_ip_addresses = (known after apply)
      + connector_outbound_ip_addresses = (known after apply)
      + enabled                         = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "example-logic-app"
      + resource_group_name             = "darts-migration-prod-rg"
      + workflow_endpoint_ip_addresses  = (known after apply)
      + workflow_outbound_ip_addresses  = (known after apply)
      + workflow_schema                 = jsonencode(
            {
              + "$schema"      = "https://schema.management.azure.com/providers/Microsoft.Logic/schemas/2016-06-01/workflowdefinition.json#"
              + actions        = {
                  + Execute_PowerShell_Script = {
                      + inputs   = {
                          + body    = {
                              + script = "Your PowerShell script here"
                            }
                          + headers = {
                              + Content-Type = "application/json"
                            }
                          + method  = "POST"
                          + uri     = "<URL of your PowerShell script>"
                        }
                      + runAfter = {
                          + Initialize_variable = [
                              + "Succeeded",
                            ]
                        }
                      + type     = "Http"
                    }
                  + Initialize_variable       = {
                      + inputs   = {
                          + variables = [
                              + {
                                  + name  = "eventData"
                                  + type  = "Object"
                                  + value = "@triggerBody()"
                                },
                            ]
                        }
                      + runAfter = {}
                      + type     = "InitializeVariable"
                    }
                }
              + contentVersion = "1.0.0.0"
              + outputs        = {}
              + triggers       = {
                  + manual = {
                      + inputs = {
                          + schema = {}
                        }
                      + kind   = "Http"
                      + type   = "Request"
                    }
                }
            }
        )
      + workflow_version                = "1.0.0.0"
    }

  # azurerm_recovery_services_vault.darts-migration-backup[0] will be updated in-place
  ~ resource "azurerm_recovery_services_vault" "darts-migration-backup" {
        id                            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.RecoveryServices/vaults/darts-prod-rsv"
        name                          = "darts-prod-rsv"
      ~ tags                          = {
          - "application"  = "darts" -> null
          - "builtFrom"    = "https://github.com/HMCTS/darts-shared-infrastructure.git" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsassess"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsassess"
        name                                                   = "prddartsassess"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "AutomaticByOS"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsassure"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsassure"
        name                                                   = "prddartsassure"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "AutomaticByOS"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig01"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig01"
        name                                                   = "prddartsmig01"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "AutomaticByOS"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig02"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig02"
        name                                                   = "prddartsmig02"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "AutomaticByOS"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig03"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig03"
        name                                                   = "prddartsmig03"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "AutomaticByOS"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig04"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig04"
        name                                                   = "prddartsmig04"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "AutomaticByOS"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_windows_virtual_machine.migration_windows["prddartsmig05"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "migration_windows" {
      ~ bypass_platform_safety_checks_on_user_schedule_enabled = true -> false
        id                                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-migration-prod-rg/providers/Microsoft.Compute/virtualMachines/prddartsmig05"
        name                                                   = "prddartsmig05"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
      ~ patch_mode                                             = "AutomaticByPlatform" -> "AutomaticByOS"
        tags                                                   = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 15 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.application_insights.azurerm_application_insights.this has changed
  ~ resource "azurerm_application_insights" "this" {
      ~ connection_string                     = (sensitive value)
        id                                    = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/darts-prod-rg/providers/Microsoft.Insights/components/darts-prod"
        name                                  = "darts-prod"
        tags                                  = {
            "application"         = "darts"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "production"
            "managedBy"           = "Darts Modernisation"
        }
        # (15 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":213,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->